In [1]:
import pandas as pd
import numpy as np     # importing libraries

In [5]:
hr_data = pd.read_csv("HR_Analytics_Dataset.csv") # loading the Dataset

hr_data.head() # displaying the top 5 rows of the dataset

,employee_id,gender,department,years_at_company,promotion_last_5_years,left_company
0,1,Male,Marketing,15,No,No
1,2,Female,Marketing,5,No,No
2,3,Male,Sales,10,No,Yes
3,4,Male,HR,7,No,No
4,5,Male,IT,17,No,No

In [7]:
hr_data.info()

hr_data.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   employee_id             500 non-null    int64
 1   gender                  500 non-null    object
 2   department              500 non-null    object
 3   years_at_company        500 non-null    int64
 4   promotion_last_5_years  500 non-null    object
 5   left_company            500 non-null    object
dtypes: int64(2), object(4)
memory usage: 23.6+ KB

employee_id               0
gender                    0
department                0
years_at_company          0
promotion_last_5_years    0
left_company              0
dtype: int64

In [8]:
left_employees = hr_data[hr_data["left_company"] == "Yes"]

left_employees.head()

,employee_id,gender,department,years_at_company,promotion_last_5_years,left_company
2,3,Male,Sales,10,No,Yes
5,6,Female,Sales,7,No,Yes
8,9,Male,HR,13,No,Yes
11,12,Male,HR,10,No,Yes
15,16,Male,Sales,18,Yes,Yes

In [13]:
avg_years_before_leaving = left_employees["years_at_company"].mean()

avg_years_before_leaving

9.788990825688073

In [20]:
total_employees = len(hr_data)
print("total_number_employees", total_employees)
promoted_employees = len(hr_data[hr_data["promotion_last_5_years"] == "Yes"])
promoted_employees



promotion_percentage = (promoted_employees / total_employees) * 100
promoted_employees, promotion_percentage

total_number_employees 500

(76, 15.2)

In [25]:
left_employees = hr_data[hr_data["left_company"] == "Yes"]
left_promoted = len(left_employees[left_employees["promotion_last_5_years"] == "Yes"])
left_promotion_rate = (left_promoted / len(left_employees)) * 100
stayed_employees = hr_data[hr_data["left_company"] == "No"]
stayed_promoted = len(stayed_employees[stayed_employees["promotion_last_5_years"] == "Yes"])
stayed_promotion_rate = (stayed_promoted / len(stayed_employees)) * 100
left_promotion_rate, stayed_promotion_rate

(21.100917431192663, 13.554987212276215)

In [29]:
dept_total = hr_data.groupby("department")["employee_id"].count()
dept_left = hr_data[hr_data["left_company"] == "Yes"].groupby("department")["employee_id"].count()
attrition_rate = (dept_left / dept_total) * 100

top_2_departments = attrition_rate.sort_values(ascending=False).head(2)
top_2_departments

department
HR           26.744186
Marketing    22.807018
Name: employee_id, dtype: float64

In [ ]:
## policies I suggest can be : giving employees more promotion opportunities.
## better salary  and bonuses

In [9]:
import pandas as pd
import numpy as np      ##importing pandas and numpy libraries

In [10]:
operations_df = pd.read_csv("Operations_Analytics_Dataset.csv") ## loading the operaetions datasheet

operations_df.head()   ## displaying first 5 rows to make sure data is loaded correctly

   order_id warehouse_location product_category order_month on_time_delivery
0         1               West            Books     2023-02              Yes
1         2              North      Electronics     2023-01              Yes
2         3              North             Toys     2023-09              Yes
3         4              North      Electronics     2023-02              Yes
4         5              North             Toys     2023-08              Yes

In [11]:
total_orders = len(operations_df)  ## counting the total numbers of orders

print(total_orders) ##number of total orders

late_deliveries = len(operations_df[operations_df["on_time_delivery"] == "No"]) ## creating a variable to calculate the late deliveries 

late_delivery_percentage = (late_deliveries / total_orders) * 100 ## percentage of late deliveries
 
late_delivery_percentage ## printing the late deliveries

1000

14.2

In [21]:
late_deliveries_df = operations_df[operations_df["on_time_delivery"] == "No"]
print(late_deliveries_df)

late_by_category = late_deliveries_df["product_category"].value_counts()


most_late = late_by_category.idxmax()
most_late, late_by_category[most_late]

     order_id warehouse_location product_category order_month on_time_delivery
12         13              South         Clothing     2023-07               No
15         16              North            Books     2023-01               No
16         17               West             Home     2023-03               No
32         33              South            Books     2023-06               No
44         45               West      Electronics     2023-02               No
..        ...                ...              ...         ...              ...
975       976              South            Books     2023-05               No
980       981              North         Clothing     2023-01               No
986       987              South         Clothing     2023-02               No
988       989               East             Home     2023-04               No
993       994              North             Home     2023-03               No

[142 rows x 5 columns]

('Clothing', 35)

In [22]:
late_reduction_target = late_deliveries * 0.10

late_by_warehouse = late_deliveries_df["warehouse_location"].value_counts()

savings_per_warehouse = (late_by_warehouse / late_deliveries) * 50000

savings_per_warehouse

warehouse_location
East     15845.070423
West     12323.943662
North    11971.830986
South     9859.154930
Name: count, dtype: float64

In [ ]:
## if warehouses run out of stocks, we need better forecasting. S
##Since clothes have the most delays, special handling may help to fix the issue.
# Since East Warehouse has the most late deliveries, targeted improvements may help.

                                                                        QUESTION 3

In [2]:
import pandas as pd
import numpy as np

In [3]:
finance_df = pd.read_csv("Financial_Analytics_Dataset.csv")

finance_df.head()

,transaction_id,region,product_category,sales_amount,profit_margin,transaction_month
0,1,East,Books,166.29,15.29,2023-08
1,2,West,Clothing,298.86,7.74,2023-08
2,3,South,Electronics,68.30,21.23,2023-10
3,4,North,Toys,475.24,12.99,2023-04
4,5,North,Clothing,489.68,5.22,2023-06

In [4]:
finance_df.isnull().sum() ##checking the missing values

transaction_id       0
region               0
product_category     0
sales_amount         1
profit_margin        1
transaction_month    0
dtype: int64

In [5]:
finance_df["sales_amount"].fillna(finance_df["sales_amount"].mean())
finance_df["profit_margin"].fillna(finance_df["profit_margin"].mean())

finance_df.isnull().sum()

transaction_id       0
region               0
product_category     0
sales_amount         1
profit_margin        1
transaction_month    0
dtype: int64

In [6]:
filtered_transactions = finance_df[
    (finance_df["profit_margin"] > 20) & 
    (finance_df["sales_amount"] > 300) & 
    (finance_df["transaction_month"] == "2023-07") 
]

matching_transactions = len(filtered_transactions)
matching_transactions

19

In [7]:
finance_df["profit_amount"] = (finance_df["sales_amount"] * finance_df["profit_margin"]) / 100

finance_df.head()

,transaction_id,region,product_category,sales_amount,profit_margin,transaction_month,profit_amount
0,1,East,Books,166.29,15.29,2023-08,25.425741
1,2,West,Clothing,298.86,7.74,2023-08,23.131764
2,3,South,Electronics,68.30,21.23,2023-10,14.500090
3,4,North,Toys,475.24,12.99,2023-04,61.733676
4,5,North,Clothing,489.68,5.22,2023-06,25.561296

In [13]:
top_5 = finance_df.sort_values(by="profit_amount", ascending=False).head(5)

top_5

,transaction_id,region,product_category,sales_amount,profit_margin,transaction_month,profit_amount
290,291,North,Clothing,499.47,29.84,2023-05,149.041848
116,117,East,Clothing,490.71,29.62,2023-08,145.348302
731,732,North,Electronics,488.25,29.54,2023-06,144.229050
1357,1358,West,Home,494.37,28.99,2023-03,143.317863
669,670,East,Home,487.11,29.01,2023-01,141.310611